#ifndef GOSTTRANSLIT_HPP__
#define GOSTTRANSLIT_HPP__

#include <string>
#include <vector>
#include <map>

class GostTranslit {
public:
    GostTranslit();
    std::string to_latin(const std::string& input);
    std::string to_cyrillic(const std::string& input);
protected:

    std::map<std::string, std::string> cyrillic2latin = {
        {"а", "a"}, {"б", "b"}, {"в", "v"}, {"г", "g"}, {"д", "d"},
        {"е", "e"}, {"ё", "yo"}, {"ж", "zh"}, {"з", "z"}, {"и", "i"},
        {"й", "j"}, {"к", "k"}, {"л", "l"}, {"м", "m"}, {"н", "n"},
        {"о", "o"}, {"п", "p"}, {"р", "r"}, {"с", "s"}, {"т", "t"},
        {"у", "u"}, {"ф", "f"}, {"х", "x"}, {"ц", "cz"}, {"ч", "ch"},
        {"ш", "sh"}, {"щ", "shh"}, {"ъ", "``"}, {"ы", "y`"}, {"ь", "`"},
        {"э", "e`"}, {"ю", "yu"}, {"я", "ya"},

        {"ци", "ci"}, {"це", "ce"}, {"цы", "cy"}, {"цй", "cj"}, // Исключения

        {"А", "A"}, {"Б", "B"}, {"В", "V"}, {"Г", "G"}, {"Д", "D"},
        {"Е", "E"}, {"Ё", "Yo"}, {"Ж", "Zh"}, {"З", "Z"}, {"И", "I"},
        {"Й", "J"}, {"К", "K"}, {"Л", "L"}, {"М", "M"}, {"Н", "N"},
        {"О", "O"}, {"П", "P"}, {"Р", "R"}, {"С", "S"}, {"Т", "T"},
        {"У", "U"}, {"Ф", "F"}, {"Х", "X"}, {"Ц", "Cz"}, {"Ч", "Ch"},
        {"Ш", "Sh"}, {"Щ", "Shh"}, {"Ъ", "``"}, {"Ы", "Y`"}, {"Ь", "`"},
        {"Э", "E`"}, {"Ю", "Yu"}, {"Я", "Ya"},

        {"Ци", "Ci"}, {"Це", "Ce"}, {"Цы", "Cy"}, {"Цй", "Cj"}, // Исключения
    };

    std::map<std::string, std::string> latin2cyrillic = {
        {"a", "а"}, {"b", "б"}, {"v", "в"}, {"g", "г"}, {"d", "д"},
        {"e", "е"}, {"yo", "ё"}, {"zh", "ж"}, {"z", "з"}, {"i", "и"},
        {"j", "й"}, {"k", "к"}, {"l", "л"}, {"m", "м"}, {"n", "н"},
        {"o", "о"}, {"p", "п"}, {"r", "р"}, {"s", "с"}, {"t", "т"},
        {"u", "у"}, {"f", "ф"}, {"x", "х"}, {"cz", "ц"}, {"ch", "ч"},
        {"sh", "ш"}, {"shh", "щ"}, {"``", "ъ"}, {"y`", "ы"}, {"`", "ь"},
        {"e`", "э"}, {"yu", "ю"}, {"ya", "я"},

        {"ci", "ци"}, {"ce", "це"}, {"cy", "цы"}, {"cj", "цй"}, // Исключения

        {"A", "А"}, {"B", "Б"}, {"V", "В"}, {"G", "Г"}, {"D", "Д"},
        {"E", "Е"}, {"Yo", "Ё"}, {"Zh", "Ж"}, {"Z", "З"}, {"I", "И"},
        {"J", "Й"}, {"K", "К"}, {"L", "Л"}, {"M", "М"}, {"N", "Н"},
        {"O", "О"}, {"P", "П"}, {"R", "Р"}, {"S", "С"}, {"T", "Т"},
        {"U", "У"}, {"F", "Ф"}, {"X", "Х"}, {"Cz", "Ц"}, {"Ch", "Ч"},
        {"Sh", "Ш"}, {"Shh", "Щ"}, {"``", "Ъ"}, {"Y`", "Ы"}, {"`", "Ь"},
        {"E`", "Э"}, {"Yu", "Ю"}, {"Ya", "Я"},

        {"Ci", "Ци"}, {"Ce", "Це"}, {"Cy", "Цы"}, {"Cj", "Цй"}, // Исключения

    };

    std::vector<std::string> punctuations = {
        ".", ",", "!", "?", ":", ";", "-", "(", ")", "[", "]", 
        "{", "}", "\"", "'", " ", "\t", "\n"
    };

};

#endif
